//Варіант 18. З'ясувати, чи є вектор a і вектор b колінеарними.
#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "ukr");
	float a1, a2, a3, b1, b2, b3; //Оголошуємо змінні на позначення векторів
	cout << "Введiть координати першого вектора:\n";
	cin >> a1 >> a2 >> a3;
	cout << "Введiть координати першого вектора:\n";
	cin >> b1 >> b2 >> b3;
	if (a1 / b1 == a2 / b2) {  //Перевіряємо, чи відповідні координати векторів пропорційні - пара a1-b1 та a2-b2
		if (a2 / b2 == a3 / b3) { //Перевіряємо, чи відповідні координати векторів пропорційні - пара a2-b2 та a3-b3
			cout << "Вектори колiнеарнi";
		}
		else {
			cout << "Вектори неколiнеарнi";
		}
	}
	else {
		cout << "Вектори неколiнеарнi";
	}
}
