//Варіант 18. Знаходження площі прямокутного трикутника за катетами.

#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "");
    float a, b, s; //Оголошуємо змінні для катетів і площі 
    cout << "Введiть значення першого катета: ";
    cin >> a; //Вводимо значення першого катета
    cout << "Введiть значення другого катета: ";
    cin >> b; //Вводимо значення другого катета
    s = a * b / 2; //Розраховуємо площу за формулою
    cout << "Площа трикутника = " << s; //Виводимо результат
    return 0;

}