#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "ukr");
    int m, n, k, s; 
    cout << "Введiть натуральнi числа m та n:" << endl;
    cin >> m >> n;                                                    //Вводимо з клавіатури числа m i n
    int i = 1;                                                        //Ініціалізуємо змінну для перебору чисел від 1 до m
    while (i!=m) {                                                    //Починаємо цикл, аби перевірити всі числа, менші за m
        k = i;                                                        //Призначаємо змінну k, аби проводити операції над числом
        s = 0;                                                        //Присвоюємо змінній суми цифр числа значення 0
        while (k != 0) {                                              //Починаємо цикл для обчислення суми цифр числа
            s += k % 10;                                              //Знаходимо останню цифру змінної k і додаємо її до змінної суми
            k /= 10;                                                  //Ділимо змінну k націло на 10, щоб відкинути останню цифру
        }
        if (s == n) {                                                 //Перевіряємо умову, чи сума цифр дорівнює заданому n
            cout << "Число " << i << " задовiльняє умову." << endl;   //Якщо так, виводимо число, що перевірялося
        }
        i++;                                                          //Збільшуємо i на одиницю, аби перевірити наступне число
    }
}
