m=int(input("Введіть натуральне число m: "))
n=int(input("Введіть натуральне число n: "))
i=1                                                    #Ініціалізуємо змінну для перебору чисел від 1 до m
while i!=m:                                            #Починаємо цикл, аби перевірити всі числа, менші за m
    k=i                                                #Призначаємо змінну k, аби проводити операції над числом, що перевіряється
    s=0                                                #Присвоюємо змінній суми цифр числа значення 0
    while k!=0:                                        #Починаємо цикл для обчислення суми цифр числа
        s+=k%10                                        #Знаходимо останню цифру змінної k і додаємо її до змінної суми
        k//=10                                         #Ділимо змінну k націло на 10, щоб відкинути останню цифру
    if s==n:                                           #Перевіряємо умову, чи сума цифр дорівнює заданому n
        print("Число",i, "задовільняє умову.")         #Якщо так, виводимо число, що перевірялося
    i+=1                                               #Збільшуємо і на 1, аби в наступній ітерації перевіряти наступне число

