#Варіант 18. З'ясувати, чи є вектор a і вектор b колінеарними.
a1=float(input("Введіть координати першого вектора (по одній на рядок):\n")) #Ініціалізуємо змінні на позначення координат векторів
a2=float(input())
a3=float(input())
b1=float(input("Введіть координати другого вектора (по одній на рядок):\n"))
b2=float(input())
b3=float(input())
if a1/b1==a2/b2:    #Перевіряємо, чи відповідні координати векторів пропорційні (відповідно з першими та другими координатами)
    if a2/b2==a3/b3: #Пропорційність відповідно з другими та третіми координатами
       print("Вектори колінеарні")
    else:
        print("Вектори неколінеарні")
else:
    print("Вектори неколінеарні")

